Repository: NaN-tic/trytond-discount_formula
Catalog: locale/*.po
Languages: ca

# field:account.invoice.line,discount_formula:
source: Discount Formula
ca: Fórmula descompte

# field:product.price_list.line,discount_formula:
source: Discount Formula
ca: Fórmula descompte

# field:purchase.line,discount_formula:
source: Discount Formula
ca: Fórmula descompte

# field:purchase.product_supplier.price,discount_formula:
source: Discount Formula
ca: Fórmula descompte

# field:sale.line,discount_formula:
source: Discount Formula
ca: Fórmula descompte

# field:sale.sale,sale_discount_formula:
source: Discount Formula
ca: Fórmula descompte

# model:ir.message,text:msg_invalid_amount_discount
source: The value to be substracted as discount has incorrect format. It must be either a integer or decimal number
ca: El valor que s'ha de sostraure com a descompte té un format incorrecte. Ha de ser un nombre enter o decimal

# model:ir.message,text:msg_invalid_discount_formula
source: The format for the discount formula provided "%(formula)s" is incorrect. It can only contain numeric values, and the symbols "+" "*" "/" "."
ca: El format de la fórmula de descompte proporcionada "%(formula)s" és incorrecte. Només pot contenir valors numèrics i els símbols "+" "*" "/" "".

# model:ir.message,text:msg_invalid_multiproduct_discount
source: The amounts for the products in "buy x pay y" discount "%(element)s" are not valid.
ca: Els imports dels productes en "compra x paga y" descompte "%(element)s" no són vàlids.

# model:ir.message,text:msg_invalid_percent_discount
source: The percentage provided for discount must be between 0 and 100, it is "%(element)s" instead.
ca: El percentatge proporcionat per al descompte ha d'estar entre 0 i 100, en canvi és "%(element)s".
